package com.ilivinskyi.homeworks;

//Задачи:
// 1) Получение информации о классе:
// Напишите программу, которая выводит имя класса, пакет, модификаторы доступа, и другую информацию о классе, используя рефлексию.
//
// 2) Создание объекта с использованием рефлексии:
// Напишите метод, который принимает имя класса в виде строки и возвращает новый экземпляр этого класса, используя рефлексию.
//
//
// 3) Вызов метода по имени:
// Напишите программу, которая позволяет вызывать метод объекта по его имени, передавая аргументы.
//
// 4) Анализ аннотаций:
// Создайте класс с несколькими методами, аннотируйте их различными аннотациями. Затем напишите программу, которая с
// использованием рефлексии анализирует класс и выводит информацию обо всех аннотациях, присвоенных методам.
//
// 5) Динамическая модификация класса:
// Реализуйте программу, которая динамически изменяет значение приватного поля объекта с использованием рефлексии.

public class Main {

    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}
